Revit 2027 API
BuiltInFailures.ViewFailures.CannotToggleToPerspective Property
 Cannot toggle to perspective view because the view contains annotations.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotToggleToPerspective { get; }
Public Shared ReadOnly Property CannotToggleToPerspective As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotToggleToPerspective {
	FailureDefinitionId^ get ();
}
static member CannotToggleToPerspective : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ViewFailures Class
Autodesk.Revit.DB Namespace